{
    "seeds": [
        {
            "name": "Ruffle Milk Pie",
            "description": "Also known as galatopite, this pie made of a buttery phyllo atop a creamy milk-based filling.",
            "ingredients": "7 oz (200 g) whole milk, 1.4 oz (40 g) cream, 2 large eggs, 3.5 oz (100 g) sugar, 1/2 vanilla pod or 1/2 tsp vanilla paste, 7-8 sheets store-bought phyllo, 2.8 oz (80 g) ghee, clarified butter or melted butter, cinnamon powder, icing sugar, cinnamon powder",
            "directions": "Preheat oven to 355ºF (180ºC).| Brush the pan with ghee or melted butter.|Place a phyllo sheet over a work surface and brush with the butter.|Wrinkle the sheet with care and place inside the pan.|Repeat with the rest of sheets.|Bake for 25 minutes. While phyllo is baking: In a medium saucepan pour the milk together with the cream and vanilla.|Place over medium heat and leave until it boils. Remove the heat and let it warm.|In a bowl, beat the eggs together with the sugar.|Pour some of the milk mixture and whisk quickly. We must temper the eggs to prevent them from curdling.|Continue pouring the milk mixture little by little at the same time that we beat until it is completely incorporated.|Remove the pan from the oven using kitchen gloves - pour the filling over the baked dough.|Put it back in the oven and bake for 30 minutes or until the filling has set.|Remove from the oven and allow to cool completely on a rack.|Before serving sprinkle with icing sugar and cinnamon powder.",
            "categories": "desserts|pies"
        },
        {
            "name": "Vietnamese Roasted Fish",
            "description": "A baked fish recipe that is vibrant in flavor. Pair it with rice or use as a spring-roll protein.",
            "ingredients": "1 1/2 – 2 lbs whole fish,1 stalk green onion,2-3 garlic cloves,2 tsp sesame oil,2 tbsp lemon juice,2 tbsp soy sauce,2 tbsp oyster sauce,1 tbsp sugar,1/4 tsp ground black pepper,2 tsp vegetable oil,1 tbsp melted butter,3 chopped chili peppers (for garnish),crushed peanuts",
            "directions": "Peel and finely mince the garlic. Finely chop the green onions. In a measuring cup: add the sesame oil, lemon juice, soy sauce, oyster sauce, and sugar. Stir together until the sugar is dissolved. Add the minced garlic and green onions and mix together.|Rinse fish on both sides with cool water and then pat dry with paper towels.|Line a large baking dish with 2 large pieces of foil.  Leave excess foil on both sides, enough to be able to wrap the fish later when baking.  Drizzle 1 tsp of vegetable oil onto the foil and coat evenly.  Place the fish skin side down on the foil.  Spoon marinade on top of the fish coating it evenly.  Sprinkle ground black pepper on top.  Marinate in the refrigerator for at least 1 hour.|Preheat the oven to 375°F.  While the oven is heating up, remove the fish from the refrigerator.  When the oven is up to temperature, wrap the fish using the foil from the pan creating a tent.  Fold over the ends as well.  This will keep all of the hot air in the tent.  Bake for 15 minutes.|Remove the fish from the oven and carefully peel back the foil.  Brush the fish with melted butter.  Set the oven to broil and bake the fish for another 5- 7 minutes until it is golden brown.|Remove from the oven and allow to cool for 5 minutes.  Transfer fish to a serving dish.  Top with scallion oil and the crushed peanuts.",
            "categories": "seafood|fish|Vietnamese"
        },
        {
            "name": "Pumpkin Chocolate Chip Cookies",
            "description": "This fall-favorite is soft and chewy, and the melty dark chocolate complements the pumpkin flavor nicely.",
            "ingredients": "1 cup pumpkin puree|1 cup granulated sugar|1/2 cup vegetable oil|1 large egg|1 tbsp pure vanilla extract|2 cups all-purpose flour|2 tsp baking powder|1 tsp ground cinnamon|1/2 tsp pumpkin spice|1/2 tsp fine sea salt|1 tsp baking soda|1 tsp milk|1 1/2-2 cups dark chocolate chips",
            "directions": "Pre-heat oven to 350°F. Line a baking sheet with parchment paper or a baking mat. Set aside.|Combine pumpkin, sugar, vegetable oil, vanilla and egg in a large bowl. Mix until smooth.|In a separate bowl, stir together flour, baking powder, ground cinnamon, pumpkin spice and salt. If you like a fluffier cookie, dissolve the baking soda with the milk and stir into the wet ingredients.|Add flour mixture to pumpkin mixture and mix just until combined. Finally stir in chocolate chips and stir until combined.|Drop cookies on by the spoonful about 2 inches apart. Add a few extra chocolate chips to the tops if desired.|Bake for 10-11 minutes, or until a toothpick comes clean. Allow to cool on pan for 2 minutes and then transfer to a cooling rack.",
            "categories": "desserts|cookies"
        },
        {
            "name": "Silver Dollar Pancakes",
            "description": "Want pancakes, but mini? Silver dollars are fluffy AND adorable.",
            "ingredients": "1 1/2 cups all-purpose flour|3 1/2 tsp baking powder|1/4 tsp salt|4 tsp white sugar|1 1/4 cups milk|1 egg|4 tbsp butter, melted",
            "directions": "Add the dry ingredients and whisk together, then add the wet and combine fully.|I tend to just put everything in a bowl and whisk, these pancakes are really fuss free.|Heat a pan or griddle on medium-low heat and coat with a small layer of butter.|Using a tbsp measure use about 3/4 of a tbsp of batter (just scoop with the tbsp measure without scraping out the entire amount, a quick pour will leave enough behind).|Cook the pancakes on both sides until lightly browned, about 45 seconds on each side.",
            "categories": "breakfast|pancakes"
        },
        {
            "name": "Lemon-Lavender Shortbread Cookies",
            "description": "Delicate cookies infused with a tangy lemon flavor and floral notes of lavender. Dip them chocolate for an extra dash of sweetness.",
            "ingredients": "1 cup (226g) unsalted butter, softened|3/4 cup (150g) granulated sugar|2 1/2 tbsp (15g) lemon zest (from about 4 medium lemons)|1/2 tsp lavender flowers|1/4 tsp salt|2 tsp fresh lemon juice|1 tsp vanilla extract|2 cups (284g) all-purpose flour|12 oz. chocolate candy melts|1/3 cup (50g) unsalted pistachios, chopped",
            "directions": "In the bowl of an electric stand mixer cream together butter, sugar, lemon zest, lavender and salt.|Mix in lemon juice and vanilla extract.|Add flour and mix until well combined (it will seem sandy at first but keep mixing and it will come together well).|Scoop dough out and compress dough with your hands (so there are no holes in the middle).|Shape into a 10-inch log on a lightly floured surface.|Wrap in parchment or plastic wrap and chill 2 hours or until firm.|Preheat oven to 350 degrees during last 15 minutes of chilling.|Remove dough from refrigerator and slice log into 1/3-inch thick slices. Transfer 12 slices to ungreased 18 by 13-inch baking sheet and bake until bottoms are lightly golden and cookies are set, about 13 - 16 minutes.|Keep remaining dough chilled. Repeat process with remaining dough, adding slices to a clean, cool baking sheet.|Let cookies cool on baking sheet 10 minutes then transfer to a wire rack to cool completely.|Once cool melt vanilla candy melts or white chocolate in a microwave safe bowl in 30 second increments, stirring well between intervals until melted and smooth.|Dip half of each cooking in candy melts, shake off excess, then transfer to a sheet or parchment paper. Sprinkle with chopped pistachios before is starts to set.|Let set then store in an airtight container at room temperature.",
            "categories": "desserts|cookies"
        },
        {
            "name": "Lemon Cream Sea Bass & Creamy Spinach",
            "description": "Sea bass is always a winner, and this decadent lemon cream brings it over the top.",
            "ingredients": "1 tbsp butter, softened|1 tsp chopped garlic|12 oz. fresh leaf spinach|7 oz of mushrooms|1/4 cup heavy whipping cream|1 cup all-purpose flour for dredging, seasoned with salt and pepper|1 1/2 lbs Chilean sea bass fillets|salt and pepper|4 tbsp butter/olive oil combination|1 tbsp butter|2 tbsp olive oil|2 tsp minced garlic|1/4 cup white cooking wine|1/2 cup chicken broth|1 cup heavy whipping cream|3 tbsp grated Parmesan cheese|1 tsp oregano (fresh, if available)|1/4 tsp sea salt|1/2 tsp black pepper|1 lemon for zest, then use half the lemon for juice",
            "directions": "Preheat oven to 200°F|Pre-heat cooking pan to medium heat and add butter and olive oil. Once the butter melts, add minced garlic and cook garlic for 1 minute. Add the spinach and pour 1/4 cup of heavy cream over the spinach. Cook spinach just until it begins to wilt but do not over cook. Remove from heat and put to the side, or in the oven to keep warm.|Place flour for dredging in a shallow bowl. Salt and pepper the fillets. Coat each fillet with flour and shake off excess. Heat a large nonstick skillet over medium heat for 3 to 4 minutes. Add butter/olive oil combination. Add the fillets, without crowding. Increase heat to high and saute, shaking the pan from time to time, until the bottom of the fish is nicely browned, about 3 minutes. Turn and brown the other side. Remove fish to a plate and keep warm in the oven.|Pre-heat separate cooking pan to medium heat and add butter. Once the butter melts, add minced garlic and allow to cook for 1 to 2 minutes. Add wine and chicken broth and cook for 3 minutes. Add the heavy whipping cream, Parmesan cheese, oregano, black pepper and sea salt.|Zest the skin of the lemon into the sauce and slice the lemon in half and squeeze juice from half of the lemon into the sauce. Cook on low/medium heat until it binds together.|Taste as you go. If you want more lemon, add it.|Plate spinach and sea bass. Drizzle sauce over the fish, save some for extra drizzle.",
            "categories": "seafood|fish"
        },
        {
            "name": "Key Lime Pie with Macadamia Nut Crust",
            "description": "A balance of sweet and tangy, this creamy pie pairs nicely with a nutty crust.",
            "ingredients": "9 (135g) full-sheet graham crackers|1/2 cup (62g) salted macadamia nuts (roasted)|1 tbsp granulated sugar|5 tbsp (72g) unsalted butter, melted|2 (14 oz) cans sweetened condensed milk|1 cup (240ml) key lime juice|4 large egg yolks|garnish: lime zest, lime slices, macadamia nuts, whipped cream, or meringue topping",
            "directions": "Preheat oven to 350°F.|Make the crust: Using a food processor, pulse the graham crackers and macadamia nuts together into crumbs. A few larger pieces of nuts is OK! Pour into a medium bowl and stir in sugar and melted butter until combined. Press tightly into the bottom and up the sides of a 9-inch pie dish. Pre-bake crust for 8 minutes. Leave oven on.|Make the filling: Whisk the sweetened condensed milk, lime juice, and egg yolks together– or use an electric mixer. Pour into warm crust.|Bake the pie for 15-20 minutes or until only *slightly* jiggly in the center. You want it mostly set. Remove from the oven and allow to cool completely on a wire rack. Once cool, cover and chill for at least 1 hour (and up to 3 days) before serving.|Garnish as desired. Store leftovers in the refrigerator for up to 1 week.",
            "categories": "dessert|pies"
        },
        {
            "name": "Pomegranate-Lychee Panna Cotta",
            "description": "Refreshing flavors make this the perfect anytime dessert.",
            "ingredients": "14 oz of fresh lychee flesh|2 tsp powdered gelatin|1 cup heavy cream|1 cup whole milk|2 tbsp sugar|1½ tsp powdered gelatin|1 cup pomegranate juice (POM Wonderful worked wonderfully)| ½ cup sugar",
            "directions": "Peel lychees, retain flesh and liquid until you have 14 oz. Put all into a food processor. Process until the mixture is smooth. There will still be little bits of lychee flesh and pulp. Strain into a measuring cup until you get 1 cup of clear liquid.|Place 3 tbsp of cold water in a small bowl and sprinkle the gelatin over the top. Let sit while you do the next step.|Combine lychee liquid, cream, milk, and sugar in a medium saucepan. Heat on medium, stirring, until the sugar is dissolved and it just comes to a boil.|Remove lychee mixture from heat and add gelatin. Stir until the gelatin is fully melted and combined.|Divide mixture among glasses and refrigerate until set, at least 2 hours. (Try for longer if you can. Mine did not set all the way at 2 hours.)|Place 3 tbsp of cold water in a small bowl and sprinkle the gelatin over the top. Let sit while you do the next step.|Combine pomegranate juice and sugar in a medium saucepan and heat on medium, stirring until sugar is dissolved.|Add gelatin and stir until it is fully melted and combined.|Remove from heat and let cool for about 10 minutes.|Pour pomegranate mixture over the lychee panna cotta and refrigerate until set, about 2 hours.",
            "categories": "dessert|panna cotta"
        },
        {
            "name": "Chili-Lime Tacos",
            "description": "When you are not feeling like starting the grill, these easy stove-top tacos will hit the spot!",
            "ingredients": "1 ½ tsp chili powder|1 tsp ground cumin|1 tsp dried oregano|½ tsp salt|½ tsp black pepper|1 clove garlic, minced|2 tbsp lime juice, or 1 lime",
            "directions": "In a small bowl, combine the chili powder, cumin, oregano, salt, pepper, garlic, and lime juice.|Slice the steak thinly, against the grain of the meat.|Rub the chili lime rub all over the steak in a thin, even layer.|Grill the steak on either a grill or stove-top grill pan. To get the “X” grill marks, sear the steak for 1 minute, then adjust about 90 degrees and grill for another minute.|Flip the steak when you’ve achieved the desired grill marks and repeat the process on the other side.|If cooking on a pan, just toss the meat in some oil or butter until browned to the desired level.|Allow the steak to rest for 5-10 minutes once taken off the heat.|Prepare the tacos by topping the corn tortillas with a few strips of meat, salsa, the avocado cilantro lime sauce, and cilantro, and serve.|Top with: pico de gallo, salsa, cheeses of your choice, lettuce, cilantro-lime rice, lime for garnish",
            "categories": "Mexican|tacos"
        },
        {
            "name": "Cream Linguine alle Vongole",
            "description": "Clams are great on their own, but this creamy concoction will ",
            "ingredients": "oil|7 cloves large garlic minced (divided into portions of 3 cloves and 4 cloves)|3 ½ pounds Manila clams, scrubbed and purged|1 cup white wine|½ cup water|pinch red chili flakes or as much as you like|½ medium onion minced|½ pound 70/100 shrimp peeled and deveined, chopped (optional)|¼ cup heavy cream|½ cup Parmesan grated|2 sprigs thyme fresh|¼ cup parsley fresh, finely chopped|1 pound linguine",
            "directions": "Coat a large sauté pan with oil and heat to medium-high. Add 3 cloves of minced garlic and cook until golden (be careful not to burn the garlic). Add about two thirds of the clams to the pan along with wine and water. Cover and steam for about 5 minutes until the clams open. Carefully remove the clams and place in a large bowl to cool. (Discard any clams that have not open.) While the clams cool, reduce the wine sauce. When reduced, reserve the wine sauce for later use. When the clams are cooled, remove the meat from the shells and discard the shells.|Bring a large pot of salted water to boil.|Using the same pan, add butter, chili flakes, 4 cloves of minced garlic, and onions. Sauté for about 5 minutes until the onion is softened. Add the chopped shrimp, cream, reserved clams, and reduced wine sauce (make sure to not add the grit at the bottom). Stir and add the remaining clams, cover and steam for about five minutes or until the clams open. (Discard any clams that have not open.) |Drop the fresh linguine into the boiling water and cook for a few minutes until al dente. (If using dry pasta, boil for the recommended time on the package).|While the linguine cooks, add in Parmesan, thyme leaves, and parsley.|Add the cooked linguine into the pan and toss to coat. Divide the pasta among four bowls, top each with equal amounts of clam (in shells). Top each bowl with grated Parmesan, red chili flakes, fresh cracked pepper, and parsley.",
            "categories": "seafood|pasta|clams"
        },
        {
            "name": "Thai Basil Fried Rice",
            "description": "A super fragrant fried-rice recipe, with strong Thai basil scents and spicy umami flavors.",
            "ingredients": "5 garlic cloves|1 to 5 Thai chilis|1 medium shallot|2 tbsp oyster sauce|1tbsp fish sauce|1 tbsp palm sugar or honey|1/4 tsp white pepper|2 tbsp unsalted butter|12 oz 16/20 extra jumbo shrimp, peeled & deveined|2 eggs|2 1/2 cups day-old cold jasmine rice|handful holy basil, Thai basil or Italian basil",
            "directions": "Grind garlic and thai chili together in a mortar and pestle. This way the natural oils from chili and garlic will be released and will make the fried rice more fragrant|Mix oyster sauce, fish sauce, palm sugar (or honey) and pepper in a small mixing bowl, set aside.|Heat a large skillet or a wok over high heat until smoking. Add butter, garlic, chili shallot and shrimp. Stir fry everything and cook the shrimp 1 minute each side, then mix everything in the wok and push to a side of the wok.|Crack 2 eggs in the wok. Let the eggs cook a bit then scramble the eggs. When eggs are cooked but still silky, toss everything together.|Add cold rice and pour sauce mixture. Toss everything together until rice is coated evenly with the sauce, about 2 to 3 minutes.|Toss in basil and turn off the heat. Keep tossing until basil is well combined with the fried rice.",
            "categories": "Thai|fried rice"
        }
    ]
}